def cards():
    return """Студенческий билет — один из важнейших документов, удостоверяющий ваш статус студента. Он необходим для посещения учебных корпусов университета, а также для получения множества льгот и скидок:
Скидки на посещение музеев, театров, кинотеатров и кафе.
Льготные тарифы на городской и пригородный общественный транспорт.
Бесплатное посещение зоопарка каждый первый день месяца.
Студенческий билет выдается первокурсникам на собраниях кафедр в институтах в первый учебный день при условии своевременной сдачи фотографии. Обратите внимание, что студенческий билет необходимо ежегодно продлевать в деканате.
Дополнительно, каждый студенческий билет первокурсника содержит специальный штрих-код, который служит в качестве электронного читательского билета, предоставляющего доступ к ресурсам Зональной научной библиотеки.
В случае утери или порчи студенческого билета следует обратиться в деканат вашего института для его восстановления.
Для доступа в учебные корпуса студенческий билет также выполняет функцию пластиковой карты (СКУД), позволяющей проходить через турникеты. Для проживающих в студенческих общежитиях предусмотрены отдельные электронные пропуска, которые также позволяют входить в корпуса университета (лайфхак для студентов). Электронные пропуска выдаются в течение первого семестра в деканате. До момента их получения вход в университет возможен по студенческому билету.  Банковская карта для студентов бюджетной формы обучения — это именно тот инструмент, на который будет начисляться ваша стипендия в конце каждого месяца. Информация о месте и времени оформления карт публикуется институтами в их группах ВКонтакте (раздел «Об университете», вкладка «Институты»). Для оформления карты необходимо иметь при себе оригинал паспорта и студенческий билет.
Также эта карта выполняет роль транспортной карты для студентов, предоставляя возможность пользоваться общественным транспортом Екатеринбурга по льготным тарифам. Для студентов доступны следующие тарифы: стоимость одной поездки составляет 29,50 рублей, либо можно оформить месячный проездной за 1700 рублей.
Е-КАРТУ можно оформить онлайн. При этом важно помнить, что продление карты необходимо осуществлять ежегодно в отделении."""

def auditoria():
    return "Большинство занятий проходят в очном формате, однако также предлагаются и онлайн-курсы. Очные занятия проходят в различных институтах УрФУ, а расписание доступно на платформе Modeus. Студент может нажать на название предмета, чтобы узнать номер аудитории, где будет проходить занятие. Например, «Р» в номере аудитории (например, Р-100) означает, что она находится в Радиофаке. Местоположение аудиторий можно найти с помощью навигатора УрФУ на сайте how-to-navigate.ru.  "

def navigator():
    return "Сайт «Навигатор УрФУ» (how-to-navigate.ru) предоставляет интерактивную карту учебных корпусов Уральского федерального университета (УрФУ). С его помощью студенты и посетители могут легко находить необходимые аудитории и прокладывать оптимальные маршруты между ними."

def lk_student():
    return """Личный кабинет студента — ключевой инструмент для навигации в университетской среде. В нем содержится полная информация об успеваемости, записях о внеучебной деятельности, а также предоставляется доступ к множеству полезных сервисов. Учетная запись, созданная для личного кабинета, позволяет подключаться к Wi-Fi сети университета.
Для начала работы с личным кабинетом необходимо создать учетную запись. Первокурсники могут сделать это сразу после зачисления в группу, заполнив контактные данные и пройдя процедуру подтверждения личности через сервис идентификации id.urfu.ru.
Что касается доступа в интернет, в университете развернута сеть Wi-Fi, которая охватывает практически все корпуса. Высокая скорость сети обеспечивает потребности как для учебных целей, так и для досуга.
Основная беспроводная сеть UrFU предназначена для студентов и сотрудников университета, обеспечивая доступ к корпоративной сети и интернету. Для подключения требуется ввод имени пользователя, указанного в поле «Логин» сервиса самообслуживания.
Для гостей университета доступна сеть UGMK-Telecom, которая обеспечивает только выход в интернет. Эта сеть, созданная совместно с партнером университета, позволяет авторизоваться через учетные записи социальной сети «ВКонтакте» или с помощью номера телефона. При использовании номера необходимо совершить бесплатный звонок на указанный номер для подтверждения регистрации. Регистрация в сети действует в течение одного дня, доступ предоставляется бесплатно."""

def online_course_all_info():
    return "Онлайн курсы будут занимать значительную часть учебного времени студента. Большинство онлайн курсов проходят на платформе openedu.ru. На этой платформе  студенты могут изучать не только курсы УрФУ, но и курсы вузов партнеров. Обычно студенту предлагается определенное количество тем на курсе, которые ему надо пройти до дедлайна, а после написать онлайн экзамен в конце семетра, если того требует программа курса. Обычно онлайн экзаммены курсов в Opendu проходят на платформе Improctor. Для успешного освоения онлайн-курсов на openedu.ru: создайте корпоративную почту @urfu.me, зарегистрируйтесь на платформе, выберите курс и сроки обучения, ознакомьтесь с источниками данных, определите модель обучения, следите за успеваемостью и прогрессом, пройдите итоговый контроль.  Помимо самих онлайн-курсов студенты могут получать задания от преподавателей по очным дисциплинам, которые необходимо выполнить на платформах elearn, exam1, exam2. Для успешной авторизации на этих платформах достаточно иметь аккаунт в ЛК УрФУ. Иногда по очным дисциплинам у студентов могут быть онлайн-экзамены, которые проводятся на платформах exam1 и exam2. Во время онлайн-экзамена на данных платформах происходит запись помещения, в котором студент сдает экзамен."

def rating():
    return """
    Рейтинги в университете оценивают достижения студентов в разных областях деятельности, что позволяет учитывать их успехи, активность и достижения для предоставления определённых возможностей и привилегий.

Научный рейтинг формируется на основе достижений студента за учебный год (два семестра) и учитывается в научном портфолио.
Формула расчёта: РСн = Бп + Бм + Бис + Бг + Бид + Бс + Бст
Где:
РСн — общий балл студента;
Бп — балл за научные публикации;
Бм — балл за участие в научных мероприятиях;
Бис — балл за патенты и интеллектуальные права;
Бг — балл за гранты;
Бид — балл за инновационную деятельность;
Бс — балл за стипендии;
Бст — балл за стажировки.
Возможности:
Получение повышенной стипендии при подтверждении достижений в портфолио.
Подробности доступны в сервисе «Учет научных достижений».  Рейтинг внеучебной деятельности - этот рейтинг оценивает активность студентов в спорте, творчестве и общественной жизни.
Формула расчёта: Учитываются достижения в процессной и проектной деятельности.
Возможности:
Учет и отображение достижений.
Учет активности в общем рейтинге студентов.
Использование данных при переводе на бюджетную форму обучения.
Представление единого портфолио для трудоустройства, практики или стажировки.
Возможность получения бонусов и поощрений, включая стипендии и скидки.
 Общий рейтинг отражает совокупные достижения студента в учебной, научной и внеучебной деятельности.
Формула расчёта:
Для 1-2 курса бакалавриата/специалитета:
R∑ = (0,8 * Re1 + 0,2 * Ra1 * Remax1/Ramax1) + (0,8 * Re2 + 0,2 * Ra2 * Remax2/Ramax2);
Где:
R∑ — общий балл рейтинга;
Re — балл рейтинга учебной деятельности;
Ra — балл рейтинга внеучебной деятельности;
Remax, Ramax — максимальные значения баллов по итогам года.
Возможности:
Учет достижений по разным направлениям.
Подтверждение достижений при переводе на бюджет.
Использование данных для портфолио.
Получение поощрений и привилегий, включая стипендии.
"""